cnone616/Glowxel/esp32-firmware/src/main.cpp
  // 显示时间 HH:MM
  char timeStr[6];
  sprintf(timeStr, "%02d:%02d", timeinfo.tm_hour, timeinfo.tm_min);
  
  dma_display->setTextSize(clockConfig.time.fontSize);
  dma_display->setCursor(clockConfig.time.x, clockConfig.time.y);
  dma_display->setTextColor(dma_display->color565(
    clockConfig.time.r, 
    clockConfig.time.g, 
    clockConfig.time.b
  ));
  dma_display->print(timeStr);
  
  // 显示日期 MM-DD
  if (clockConfig.date.show) {
    char dateStr[6];
    sprintf(dateStr, "%02d-%02d", timeinfo.tm_mon + 1, timeinfo.tm_mday);
    
    dma_display->setTextSize(clockConfig.date.fontSize);
    dma_display->setCursor(clockConfig.date.x, clockConfig.date.y);
    dma_display->setTextColor(dma_display->color565(
      clockConfig.date.r, 
      clockConfig.date.g, 
      clockConfig.date.b
    ));
    dma_display->print(dateStr);
  }
  
  // 显示星期
  if (clockConfig.week.show) {
    const char* weekDays[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    dma_display->setTextSize(1);
    dma_display->setCursor(clockConfig.week.x, clockConfig.week.y);
    dma_display->setTextColor(dma_display->color565(
      clockConfig.week.r, 
      clockConfig.week.g, 
      clockConfig.week.b
    ));
    dma_display->print(weekDays[timeinfo.tm_wday]);
  }
}

// WebSocket 事件处理
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len) {
  if (type == WS_EVT_CONNECT) {
    Serial.printf("WebSocket 客户端已连接: %u\n", client->id());
    clientConnected = true;
    
    // 每次连接都强制回到闹钟模式
    currentMode = MODE_CLOCK;
    canvasInitialized = false; // 重置画布初始化标志
    
    // 清空画布相关数据
    if (blackPixels != nullptr) {
      free(blackPixels);
      blackPixels = nullptr;
    }
    blackPixelCount = 0;
    Serial.println("✓ WebSocket连接时已清空黑色像素数据");
    
    displayClock();
    
    // 发送连接成功消息，始终返回 clock 模式
    String response = "{\"status\":\"connected\",\"device\":\"LED-Matrix\",\"mode\":\"clock\"}";
    client->text(response);
  }
  else if (type == WS_EVT_DISCONNECT) {
    Serial.printf("WebSocket 客户端已断开: %u\n", client->id());
    clientConnected = false;
    
    // 断开连接后，回到闹钟模式
    currentMode = MODE_CLOCK;
    canvasInitialized = false; // 重置画布初始化标志
    
    // 清空画布相关数据
    if (blackPixels != nullptr) {
      free(blackPixels);
      blackPixels = nullptr;
    }
    blackPixelCount = 0;
    Serial.println("✓ WebSocket断开时已清空黑色像素数据");
    
    displayClock();
  }
  else if (type == WS_EVT_DATA) {
    AwsFrameInfo *info = (AwsFrameInfo*)arg;
    
    // 处理二进制数据
    if (info->opcode == WS_BINARY) {
      // 二进制格式：每5字节一个像素 (x, y, r, g, b)
      int pixelCount = len / 5;
      Serial.printf("收到二进制像素数据: %d bytes, %d 个像素, 当前模式: %s\n", 
        len, pixelCount, (currentMode == MODE_CLOCK) ? "clock" : "canvas");
      
      // 打印前10个像素的原始数据用于调试
      Serial.println("=== 前10个像素的原始数据 ===");
      for (int i = 0; i < min(10, pixelCount); i++) {
        int idx = i * 5;
        if (idx + 4 < len) {
          uint8_t x = data[idx];
          uint8_t y = data[idx + 1];
          uint8_t r = data[idx + 2];
          uint8_t g = data[idx + 3];
          uint8_t b = data[idx + 4];
          Serial.printf("像素#%d: x=%d, y=%d, r=%d, g=%d, b=%d %s\n", 
            i, x, y, r, g, b, (r == 0 && g == 0 && b == 0) ? "[黑色]" : "");
        }
      }
      Serial.println("=== 原始数据结束 ===");
      
      if (pixelCount > 0) {
        // 画板模式：保存到 canvasBuffer（64x64完整画布）
        if (currentMode == MODE_CANVAS) {
          Serial.println("画板模式：更新画布缓冲区");
          
          // 第一次接收时初始化画布（清空）
          if (!canvasInitialized) {
            Serial.println("初始化画布缓冲区");
            memset(canvasBuffer, 0, sizeof(canvasBuffer));
            canvasInitialized = true;
            
            // 清空之前的黑色像素记录
            if (blackPixels != nullptr) {
              free(blackPixels);
              blackPixels = nullptr;
            }
            blackPixelCount = 0;
          }
          
          // 先统计本批有效的黑色像素数量（在范围内的）
          int newBlackCount = 0;
          for (size_t i = 0; i + 4 < len; i += 5) {
            uint8_t x = data[i];
            uint8_t y = data[i + 1];
            uint8_t r = data[i + 2];
            uint8_t g = data[i + 3];
            uint8_t b = data[i + 4];
            if (x < PANEL_RES_X && y < PANEL_RES_Y && r == 0 && g == 0 && b == 0) {
              newBlackCount++;
            }
          }
          
          Serial.printf("本批发现 %d 个有效黑色像素\n", newBlackCount);
          
          // 扩展黑色像素数组（累加，不是替换）
          if (newBlackCount > 0) {
            BlackPixel* newBuffer = (BlackPixel*)realloc(blackPixels, sizeof(BlackPixel) * (blackPixelCount + newBlackCount));
            if (newBuffer == nullptr) {
              Serial.println("✗ 黑色像素数组内存扩展失败！");
              return;
            }
            blackPixels = newBuffer;
            Serial.printf("✓ 扩展黑色像素数组: 原有 %d 个，新增 %d 个，总计 %d 个\n", 
              blackPixelCount, newBlackCount, blackPixelCount + newBlackCount);
          }
          
          int validPixels = 0;
          for (size_t i = 0; i + 4 < len; i += 5) {
            uint8_t x = data[i];
            uint8_t y = data[i + 1];
            uint8_t r = data[i + 2];
            uint8_t g = data[i + 3];
            uint8_t b = data[i + 4];
            
            if (x < PANEL_RES_X && y < PANEL_RES_Y) {
              // 存储到画布缓冲区
              canvasBuffer[y][x][0] = r;
              canvasBuffer[y][x][1] = g;
              canvasBuffer[y][x][2] = b;
              validPixels++;
              
              // 如果是黑色，记录坐标
              if (r == 0 && g == 0 && b == 0 && blackPixels != nullptr) {
                blackPixels[blackPixelCount].x = x;
                blackPixels[blackPixelCount].y = y;
                blackPixelCount++;
              }
              
              // 立即绘制
              dma_display->drawPixelRGB888(x, y, r, g, b);
            }
            
            if (i % 500 == 0) yield();
          }
          
          Serial.printf("画板模式 - 更新了 %d 个像素，累计记录了 %d 个黑色像素\n", validPixels, blackPixelCount);
          
          return;
        }
        
        // 闹钟模式：保存到 imagePixels（背景图）
        // 如果是新的一批数据（距离上次超过1秒），清空旧数据重新开始
        if (millis() - lastBinaryReceiveTime > 1000) {
          Serial.println("=== 开始接收新的像素数据，清空旧数据 ===");
          if (imagePixels != nullptr) {
            free(imagePixels);
            imagePixels = nullptr;
          }
          imagePixelCount = 0;
        }
        
        // 打印前3个像素的原始数据
        if (imagePixelCount == 0 && len >= 15) {
          Serial.println("前3个像素的原始字节:");
          for (int i = 0; i < 15; i++) {
            Serial.printf("%d ", data[i]);
          }
          Serial.println();
        }
        
        // 追加数据
        PixelData* newBuffer = (PixelData*)realloc(imagePixels, sizeof(PixelData) * (imagePixelCount + pixelCount));
        if (newBuffer != nullptr) {
          imagePixels = newBuffer;
          
