cnone616/Glowxel/esp32-firmware/src/main.cpp
          int validPixels = 0;
          // 复制像素数据
          for (size_t i = 0; i + 4 < len; i += 5) {
            // 达到最大像素数量后，忽略后续数据，避免占用过多 NVS 空间
            if (imagePixelCount >= MAX_PIXELS) {
              break;
            }
            
            uint8_t x = data[i];
            uint8_t y = data[i + 1];
            uint8_t r = data[i + 2];
            uint8_t g = data[i + 3];
            uint8_t b = data[i + 4];
            
            // 打印前3个像素
            if (imagePixelCount < 3) {
              Serial.printf("像素 #%d: x=%d, y=%d, r=%d, g=%d, b=%d\n", 
                imagePixelCount, x, y, r, g, b);
            }
            
            if (x < PANEL_RES_X && y < PANEL_RES_Y) {
              // 保存到内存
              imagePixels[imagePixelCount].x = x;
              imagePixels[imagePixelCount].y = y;
              imagePixels[imagePixelCount].r = r;
              imagePixels[imagePixelCount].g = g;
              imagePixels[imagePixelCount].b = b;
              imagePixelCount++;
              validPixels++;
              
              // 立即绘制
              dma_display->drawPixelRGB888(x, y, r, g, b);
            }
            
            // 每处理100个像素让出CPU，防止看门狗超时
            if (i % 500 == 0) {
              yield();
            }
          }
          
          Serial.printf("闹钟模式 - 本批有效像素: %d, 累计: %d\n", validPixels, imagePixelCount);
          
          // 更新接收时间，标记有待保存的数据
          lastBinaryReceiveTime = millis();
          binaryDataPending = true;
          
        } else {
          Serial.println("✗ 内存分配失败！");
        }
      }
      
      return;
    }
    
    // 处理JSON命令
    Serial.printf("收到 WebSocket 数据: %d bytes\n", len);
    
    // 解析JSON命令 - 使用动态分配以支持大图片数据
    DynamicJsonDocument doc(40960); // 40KB 缓冲区
    DeserializationError error = deserializeJson(doc, data, len);
    
    if (error) {
      Serial.print("JSON解析失败: ");
      Serial.println(error.c_str());
      client->text("{\"error\":\"invalid json\"}");
      return;
    }
    
    String cmd = doc["cmd"].as<String>();
    Serial.println("命令: " + cmd);
    
    StaticJsonDocument<512> response;
    response["status"] = "ok";
    
    if (cmd == "ping") {
      response["message"] = "pong";
    }
    else if (cmd == "status") {
      response["ip"] = config_mode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
      response["width"] = PANEL_RES_X;
      response["height"] = PANEL_RES_Y;
      response["brightness"] = currentBrightness;
      if (currentMode == MODE_CLOCK) {
        response["mode"] = "clock";
      } else if (currentMode == MODE_CANVAS) {
        response["mode"] = "canvas";
      }
    }
    else if (cmd == "set_mode") {
      String mode = doc["mode"].as<String>();
      if (mode == "clock") {
        currentMode = MODE_CLOCK;
        displayClock();
        response["message"] = "switched to clock mode";
      } else if (mode == "canvas") {
        currentMode = MODE_CANVAS;
        
        // 如果有画布缓冲区数据，恢复显示
        if (canvasInitialized) {
          Serial.println("恢复画布缓冲区数据");
          for (int y = 0; y < PANEL_RES_Y; y++) {
            for (int x = 0; x < PANEL_RES_X; x++) {
              uint8_t r = canvasBuffer[y][x][0];
              uint8_t g = canvasBuffer[y][x][1];
              uint8_t b = canvasBuffer[y][x][2];
              if (r > 0 || g > 0 || b > 0) {
                dma_display->drawPixelRGB888(x, y, r, g, b);
              }
            }
            if (y % 8 == 0) yield();
          }
        } else {
          dma_display->clearScreen();
        }
        
        response["message"] = "switched to canvas mode";
      } else {
        response["status"] = "error";
        response["message"] = "invalid mode";
      }
    }
    else if (cmd == "set_clock_config") {
      // 接收闹钟配置
      JsonObject config = doc["config"];
      
      // 时间配置
      if (config.containsKey("time")) {
        JsonObject time = config["time"];
        clockConfig.time.fontSize = time["fontSize"] | 1;
        clockConfig.time.x = time["x"] | 17;
        clockConfig.time.y = time["y"] | 18;
        JsonObject timeColor = time["color"];
        clockConfig.time.r = timeColor["r"] | 100;
        clockConfig.time.g = timeColor["g"] | 200;
        clockConfig.time.b = timeColor["b"] | 255;
      }
      
      // 日期配置
      if (config.containsKey("date")) {
        JsonObject date = config["date"];
        clockConfig.date.show = date["show"] | true;
        clockConfig.date.fontSize = date["fontSize"] | 1;
        clockConfig.date.x = date["x"] | 3;
        clockConfig.date.y = date["y"] | 30;
        JsonObject dateColor = date["color"];
        clockConfig.date.r = dateColor["r"] | 120;
        clockConfig.date.g = dateColor["g"] | 120;
        clockConfig.date.b = dateColor["b"] | 120;
      }
      
      // 星期配置
      if (config.containsKey("week")) {
        JsonObject week = config["week"];
        clockConfig.week.show = week["show"] | true;
        clockConfig.week.x = week["x"] | 23;
        clockConfig.week.y = week["y"] | 44;
        JsonObject weekColor = week["color"];
        clockConfig.week.r = weekColor["r"] | 100;
        clockConfig.week.g = weekColor["g"] | 100;
        clockConfig.week.b = weekColor["b"] | 100;
      }
      
      // 图片配置
      if (config.containsKey("image")) {
        JsonObject image = config["image"];
        clockConfig.image.show = image["show"] | false;
        clockConfig.image.x = image["x"] | 0;
        clockConfig.image.y = image["y"] | 0;
        clockConfig.image.width = image["width"] | 64;
        clockConfig.image.height = image["height"] | 64;
      }
      
      // 保存到 Preferences
      preferences.begin("clock", false);
      preferences.putBytes("config", &clockConfig, sizeof(ClockConfig));
      preferences.end();
      
      Serial.println("闹钟配置已更新并保存");
      
      // 如果当前是闹钟模式，立即刷新显示
      if (currentMode == MODE_CLOCK) {
        displayClock();
      }
      
      response["message"] = "clock config updated and saved";
    }
    else if (cmd == "set_image_pixels") {
      // 接收图片像素数据
      JsonArray pixels = doc["pixels"];
      
