cnone616/Glowxel/esp32-firmware/src/main.cpp
      if (pixels.size() == 0) {
        response["status"] = "error";
        response["message"] = "no pixels data";
      } else {
        // 释放旧的像素数据
        if (imagePixels != nullptr) {
          free(imagePixels);
          imagePixels = nullptr;
        }
        
        // 分配新的像素数据（最多 64x64 像素）
        imagePixelCount = pixels.size();
        if (imagePixelCount > MAX_PIXELS) {
          Serial.printf("像素数量过大（%d），截断到最大值 %d\n", imagePixelCount, MAX_PIXELS);
          imagePixelCount = MAX_PIXELS;
        }
        imagePixels = (PixelData*)malloc(sizeof(PixelData) * imagePixelCount);
        
        if (imagePixels == nullptr) {
          response["status"] = "error";
          response["message"] = "memory allocation failed";
          imagePixelCount = 0;
        } else {
          // 复制像素数据
          for (int i = 0; i < imagePixelCount; i++) {
            JsonObject pixel = pixels[i];
            imagePixels[i].x = pixel["x"];
            imagePixels[i].y = pixel["y"];
            imagePixels[i].r = pixel["r"];
            imagePixels[i].g = pixel["g"];
            imagePixels[i].b = pixel["b"];
            
            // 每100个像素让出CPU
            if (i % 100 == 0) yield();
          }
          
          // 保存像素数据到 Preferences（限制为最多 64x64 像素）
          preferences.begin("clock", false);
          size_t dataSize = imagePixelCount * sizeof(PixelData);
          size_t maxDataSize = MAX_PIXELS * sizeof(PixelData);
          if (dataSize <= maxDataSize) {
            preferences.putBytes("pixels", imagePixels, dataSize);
            preferences.putInt("pixelCount", imagePixelCount);
            Serial.printf("像素数据已保存: %d 个像素（%d bytes）\n", imagePixelCount, dataSize);
          } else {
            Serial.printf("像素数据太大（%d bytes），无法保存到 Preferences，最大允许 %d bytes\n",
              dataSize, maxDataSize);
          }
          preferences.end();
          
          // 如果当前是闹钟模式，立即刷新显示
          if (currentMode == MODE_CLOCK) {
            displayClock();
          }
          
          response["message"] = "image pixels updated and saved";
          response["count"] = imagePixelCount;
        }
      }
    }
    else if (cmd == "get_pixel_count") {
      // 查询当前保存的像素数量
      response["pixelCount"] = imagePixelCount;
      response["message"] = "current pixel count";
    }
    else if (cmd == "clear") {
      dma_display->clearScreen();
      
      // 如果是画板模式，清空画布缓冲区
      if (currentMode == MODE_CANVAS && canvasInitialized) {
        Serial.println("清空画布缓冲区");
        memset(canvasBuffer, 0, sizeof(canvasBuffer));
      }
      
      response["message"] = "cleared";
    }
    else if (cmd == "brightness") {
      int value = doc["value"];
      if (value >= 0 && value <= 255) {
        currentBrightness = value;
        dma_display->setBrightness8(value);
        response["brightness"] = value;
      } else {
        response["status"] = "error";
        response["message"] = "brightness must be 0-255";
      }
    }
    else if (cmd == "highlight_color") {
      // 高亮指定颜色，其他颜色降低亮度
      // 如果 color 为空或 null，则恢复所有颜色的原亮度
      if (currentMode == MODE_CANVAS && canvasInitialized) {
        bool hasHighlight = doc.containsKey("color") && !doc["color"].isNull();
        uint8_t highlightR = 0, highlightG = 0, highlightB = 0;
        
        if (hasHighlight) {
          JsonObject color = doc["color"];
          highlightR = color["r"] | 0;
          highlightG = color["g"] | 0;
          highlightB = color["b"] | 0;
          Serial.printf("高亮颜色: RGB(%d, %d, %d)\n", highlightR, highlightG, highlightB);
          
          // 如果是黑色，用存储的坐标亮白灯
          if (highlightR == 0 && highlightG == 0 && highlightB == 0) {
            Serial.printf("高亮黑色像素，blackPixelCount=%d\n", blackPixelCount);
            // 先清空屏幕
            dma_display->clearScreen();
            // 然后让黑色像素位置亮白灯
            for (int i = 0; i < blackPixelCount; i++) {
              Serial.printf("点亮黑色像素 #%d: (%d, %d)\n", i+1, blackPixels[i].x, blackPixels[i].y);
              dma_display->drawPixelRGB888(blackPixels[i].x, blackPixels[i].y, 255, 255, 255);
            }
            Serial.printf("✓ 共点亮了 %d 个黑色像素位置\n", blackPixelCount);
          } else {
            // 处理其他颜色：匹配的亮白灯，不匹配的不亮
            dma_display->clearScreen(); // 先清空屏幕
            
            for (int y = 0; y < PANEL_RES_Y; y++) {
              for (int x = 0; x < PANEL_RES_X; x++) {
                uint8_t r = canvasBuffer[y][x][0];
                uint8_t g = canvasBuffer[y][x][1];
                uint8_t b = canvasBuffer[y][x][2];
                
                if (r > 0 || g > 0 || b > 0) {
                  // 判断是否是高亮颜色（允许一定误差）
                  bool isHighlight = (abs(r - highlightR) <= 2 && 
                                     abs(g - highlightG) <= 2 && 
                                     abs(b - highlightB) <= 2);
                  
                  if (isHighlight) {
                    // 匹配的颜色，亮白灯
                    dma_display->drawPixelRGB888(x, y, 255, 255, 255);
                  }
                  // 不匹配的颜色不亮（保持黑色）
                }
              }
              if (y % 8 == 0) yield();
            }
          }
        } else {
          Serial.println("取消高亮，恢复所有颜色");
          
          // 恢复显示完整的彩色像素图
          for (int y = 0; y < PANEL_RES_Y; y++) {
            for (int x = 0; x < PANEL_RES_X; x++) {
              uint8_t r = canvasBuffer[y][x][0];
              uint8_t g = canvasBuffer[y][x][1];
              uint8_t b = canvasBuffer[y][x][2];
              dma_display->drawPixelRGB888(x, y, r, g, b);
            }
            if (y % 8 == 0) yield();
          }
        }
        
        response["message"] = hasHighlight ? "color highlighted" : "highlight cleared";
      } else {
        response["status"] = "error";
        response["message"] = "not in canvas mode or canvas not initialized";
      }
    }
    else if (cmd == "highlight_row") {
      // 高亮指定行，其他行降低亮度
      // 如果 row 为 -1 或 null，则恢复所有行的原亮度
      if (currentMode == MODE_CANVAS && canvasInitialized) {
        int highlightRow = doc["row"] | -1;
        
        if (highlightRow >= 0 && highlightRow < PANEL_RES_Y) {
          Serial.printf("高亮行: %d\n", highlightRow);
        } else {
          Serial.println("取消行高亮，恢复所有行");
        }
        
        // 遍历画布缓冲区，调整亮度
        for (int y = 0; y < PANEL_RES_Y; y++) {
          for (int x = 0; x < PANEL_RES_X; x++) {
            uint8_t r = canvasBuffer[y][x][0];
            uint8_t g = canvasBuffer[y][x][1];
            uint8_t b = canvasBuffer[y][x][2];
            
            if (r > 0 || g > 0 || b > 0) {
              uint8_t displayR = r, displayG = g, displayB = b;
              
              if (highlightRow >= 0 && y != highlightRow) {
                // 不是高亮行，降低亮度到20%
                displayR = r * 0.2;
                displayG = g * 0.2;
                displayB = b * 0.2;
              }
              
              dma_display->drawPixelRGB888(x, y, displayR, displayG, displayB);
            }
          }
          if (y % 8 == 0) yield();
        }
        
        response["message"] = (highlightRow >= 0) ? "row highlighted" : "highlight cleared";
      } else {
        response["status"] = "error";
        response["message"] = "not in canvas mode or canvas not initialized";
      }
    }
    else if (cmd == "text") {
      String text = doc["text"].as<String>();
      int x = doc["x"] | 0;
      int y = doc["y"] | 0;
      dma_display->clearScreen();
      dma_display->setCursor(x, y);
      dma_display->setTextColor(dma_display->color565(255, 255, 255));
      dma_display->print(text);
      response["message"] = "text displayed";
    }
    else if (cmd == "pixel") {
      int x = doc["x"];
      int y = doc["y"];
      int r = doc["r"] | 255;
      int g = doc["g"] | 255;
      int b = doc["b"] | 255;
      if (x >= 0 && x < PANEL_RES_X && y >= 0 && y < PANEL_RES_Y) {
        dma_display->drawPixelRGB888(x, y, r, g, b);
        response["message"] = "pixel set";
      } else {
        response["status"] = "error";
        response["message"] = "pixel out of range";
      }
    }
    else if (cmd == "image") {
      JsonArray pixels = doc["pixels"];
      int width = doc["width"] | PANEL_RES_X;
      int height = doc["height"] | PANEL_RES_Y;
      
      dma_display->clearScreen();
      int idx = 0;
      for (int y = 0; y < height && y < PANEL_RES_Y; y++) {
        for (int x = 0; x < width && x < PANEL_RES_X; x++) {
          if (idx + 2 < pixels.size()) {
            uint8_t r = pixels[idx++];
            uint8_t g = pixels[idx++];
            uint8_t b = pixels[idx++];
            dma_display->drawPixelRGB888(x, y, r, g, b);
          }
        }
        // 每行让出CPU，防止看门狗超时
        if (y % 8 == 0) yield();
      }
      response["message"] = "image displayed";
    }
    else if (cmd == "image_sparse") {
      // 稀疏像素格式：只传输非空像素
      // 不自动清屏，由客户端控制
      JsonArray pixels = doc["pixels"];
      
      for (JsonVariant pixel : pixels) {
        int x = pixel["x"];
        int y = pixel["y"];
        uint8_t r = pixel["r"];
        uint8_t g = pixel["g"];
        uint8_t b = pixel["b"];
        
        if (x >= 0 && x < PANEL_RES_X && y >= 0 && y < PANEL_RES_Y) {
          dma_display->drawPixelRGB888(x, y, r, g, b);
        }
      }
      response["message"] = "sparse pixels drawn";
      response["count"] = pixels.size();
    }
    else if (cmd == "image_chunk") {
      // 分块传输格式
      JsonArray pixels = doc["pixels"];
      int width = doc["width"];
      int offsetX = doc["offsetX"] | 0;
      int offsetY = doc["offsetY"] | 0;
      int height = doc["height"];
      int chunk = doc["chunk"] | 0;
      int total = doc["total"] | 1;
      
      // 第一块时清空屏幕
      if (chunk == 0) {
        dma_display->clearScreen();
      }
      
