cnone616/Glowxel/esp32-firmware/src/main.cpp
      int idx = 0;
      for (int y = 0; y < height; y++) {
        for (int x = 0; x < width; x++) {
          if (idx + 2 < pixels.size()) {
            uint8_t r = pixels[idx++];
            uint8_t g = pixels[idx++];
            uint8_t b = pixels[idx++];
            
            int drawX = x + offsetX;
            int drawY = y + offsetY;
            
            if (drawX >= 0 && drawX < PANEL_RES_X && drawY >= 0 && drawY < PANEL_RES_Y) {
              dma_display->drawPixelRGB888(drawX, drawY, r, g, b);
            }
          }
        }
        // 每行让出CPU，防止看门狗超时
        if (y % 8 == 0) yield();
      }
      response["message"] = "chunk displayed";
      response["chunk"] = chunk;
      response["total"] = total;
    }
    else {
      response["status"] = "error";
      response["message"] = "unknown command";
    }
    
    String responseStr;
    serializeJson(response, responseStr);
    client->text(responseStr);
  }
}

void setupServer() {
  // 设置 WebSocket
  ws.onEvent(onWsEvent);
  server.addHandler(&ws);
  
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");
  
  server.on("/test", HTTP_GET, [](AsyncWebServerRequest *request){
    Serial.println("收到测试请求");
    request->send(200, "text/plain", "ESP32 is working!");
  });
  
  server.onNotFound([](AsyncWebServerRequest *request){
    Serial.printf("404: %s %s\n", request->methodToString(), request->url().c_str());
    if (config_mode) {
      request->redirect("/");
    } else {
      request->send(404, "text/plain", "Not Found");
    }
  });
  
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    Serial.println("收到根路径请求");
    String html = "<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>LED Setup</title>";
    html += "<style>body{font-family:Arial;padding:20px;max-width:400px;margin:0 auto;background:#f5f5f5}";
    html += ".card{background:white;padding:20px;border-radius:10px;box-shadow:0 2px 10px rgba(0,0,0,0.1);margin-bottom:20px}";
    html += "h2{color:#333;margin-top:0}input{width:100%;padding:10px;margin:10px 0;border:1px solid #ddd;border-radius:5px;box-sizing:border-box}";
    html += "button{width:100%;padding:12px;background:#1890ff;color:white;border:none;border-radius:5px;cursor:pointer;font-size:16px;margin:5px 0}";
    html += "button:hover{background:#0070dd}button.danger{background:#dc3545}button.danger:hover{background:#c82333}";
    html += ".status{padding:10px;border-radius:5px;margin:10px 0}";
    html += ".success{background:#d4edda;color:#155724}.error{background:#f8d7da;color:#721c24}</style></head><body>";
    html += "<div class='card'><h2>LED Matrix WiFi Setup</h2><div id='status'></div>";
    html += "<label>WiFi Name (SSID):</label><input type='text' id='ssid' placeholder='Enter WiFi name'>";
    html += "<label>Password:</label><input type='password' id='password' placeholder='Enter password'>";
    html += "<button onclick='saveWiFi()'>Save & Connect</button>";
    html += "<button class='danger' onclick='clearWiFi()'>Clear WiFi Config</button></div>";
    html += "<script>";
    html += "async function saveWiFi(){const ssid=document.getElementById('ssid').value;";
    html += "const pwd=document.getElementById('password').value;if(!ssid||!pwd){alert('Please fill all fields');return;}";
    html += "try{const formData=new FormData();formData.append('ssid',ssid);formData.append('password',pwd);";
    html += "const res=await fetch('/save',{method:'POST',body:formData});const data=await res.json();";
    html += "document.getElementById('status').innerHTML='<div class=\"success\">'+data.message+'</div>';}catch(e){";
    html += "document.getElementById('status').innerHTML='<div class=\"error\">Save failed: '+e.message+'</div>';}}";
    html += "async function clearWiFi(){if(!confirm('Clear WiFi config?'))return;try{await fetch('/clear-wifi');";
    html += "document.getElementById('status').innerHTML='<div class=\"success\">WiFi config cleared</div>';}catch(e){";
    html += "document.getElementById('status').innerHTML='<div class=\"error\">Clear failed: '+e.message+'</div>';}}";
    html += "</script></body></html>";
    request->send(200, "text/html", html);
  });
  
  server.on("/save", HTTP_POST, [](AsyncWebServerRequest *request){
    if (request->hasParam("ssid", true) && request->hasParam("password", true)) {
      String ssid = request->getParam("ssid", true)->value();
      String password = request->getParam("password", true)->value();
      
      Serial.println("保存WiFi配置: " + ssid);
      
      preferences.begin("wifi", false);
      preferences.putString("ssid", ssid);
      preferences.putString("password", password);
      preferences.end();
      
      request->send(200, "application/json", "{\"status\":\"ok\",\"message\":\"配置已保存，正在重启...\"}");
      
      Serial.println("3秒后重启...");
      delay(3000);
      ESP.restart();
    } else {
      request->send(400, "application/json", "{\"error\":\"参数错误\"}");
    }
  });
  
  // 清除WiFi配置
  server.on("/clear-wifi", HTTP_GET, [](AsyncWebServerRequest *request){
    Serial.println("清除WiFi配置");
    preferences.begin("wifi", false);
    preferences.clear();
    preferences.end();
    request->send(200, "application/json", "{\"status\":\"ok\",\"message\":\"WiFi配置已清除\"}");
  });
  
  server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request){
    Serial.println("收到状态查询请求");
    StaticJsonDocument<300> doc;
    doc["status"] = "ok";
    doc["ip"] = config_mode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
    doc["width"] = PANEL_RES_X;
    doc["height"] = PANEL_RES_Y;
    doc["brightness"] = currentBrightness;
    doc["freeHeap"] = ESP.getFreeHeap();
    doc["uptime"] = millis() / 1000;
    
    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });
  
  server.on("/upload", HTTP_POST, 
    [](AsyncWebServerRequest *request){
      request->send(200, "application/json", "{\"status\":\"ok\"}");
    },
    [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final){
      if (index == 0) {
        Serial.println("开始接收图片...");
        if (imageBuffer) free(imageBuffer);
        imageBuffer = nullptr;
        imageSize = 0;
      }
      
      uint8_t* newBuffer = (uint8_t*)realloc(imageBuffer, imageSize + len);
      if (newBuffer) {
        imageBuffer = newBuffer;
        memcpy(imageBuffer + imageSize, data, len);
        imageSize += len;
      }
      
      if (final) {
        Serial.printf("接收完成，大小: %d bytes\n", imageSize);
        if (imageBuffer != nullptr && imageSize > 0) {
          int width = request->hasParam("width") ? request->getParam("width")->value().toInt() : PANEL_RES_X;
          int height = request->hasParam("height") ? request->getParam("height")->value().toInt() : PANEL_RES_Y;
          displayImage(imageBuffer, imageSize, width, height);
        } else {
          Serial.println("✗ 图片缓冲区为空，无法显示");
        }
        
